#include "IncludeAll.h"

/******数模端口控制寄存器（ANSL，ANSH）
0：模拟输入,
1：数字输入
PA引脚----->ANSL
PB引脚----->ANSH
******/

/******端口输入输出控制寄存器（PAT）
0：输出状态
1：输入状态
PA2固定为输入状态
******/

/******端口弱上拉控制寄存器（PAPU）
0：禁止
1：使能
******/

/******端口弱下拉控制寄存器（PAPD）
0：禁止
1：使能
******/

//PA0

void GpioInit(void)
{
/******PA端口*******/
	ANSL =		;// 1111 1111
	PAT  =		;// 1111 1111
	PAPD =		;// 1111 1111
	PAPU =		;// 1111 1111
/******PB端口*******/
	ANSH =		;// 1111 1111
	PBT  =		;// 1111 1111
	PBPD =		;// 1111 1111
	PBPU =		;// 1111 1111
/******PC端口******/
	PCT0  = 0;			/* PC0: 设置为输出*/
	PCPU0 = 1;			/* PC0: 开启上拉 */
	PC0   = 1;			/* PC0: 输出高电平 */

	PCT1  = 0;			/* PC1: 设置为输出*/
	PCPU1 = 1;			/* PC1: 开启上拉 */
	PC1   = 1;			/* PC1: 输出高电平 */
}

void DevInit(void)
{


}
void SetUnUsedGpio(void)
{


}
